/**
 * 함수 타입 정의
 */

// 함수를 설명하는 가장 좋은 방법
// 어떤 매개변수를 받고, 어떤 결과값을 반환하는지 이야기
// 어떤 [타입]의 매개변수를 받고, 어떤 [타입]의 결과값을 반환하는지 이야기
function func(a: number, b: number) {
  return a + b; // number 타입으로 추론해줌
}

/**
 * 화살표 함수의 타입을 정의하는 방법
 */

const add = (a: number, b: number): number => a + b;

/**
 * 함수의 매개변수
 * 선택적 매개변수
 * 💡 선택적 매개변수는 필수 매개변수 앞에 오면 안됨.
 */

function introduce(name = "이정환", tall?: number) {
  console.log(`name :${name}`);
  if (typeof tall === "number") {
    console.log(`tall :${tall + 10}`);
  }
}

introduce("이정환", 175);

// rest 매개변수에 길이값을 정의하고싶다면, ...rest: [number ,number, number] 이런식으로 정의도 가능함
function getSum(...rest: number[]) {
  let sum = 0;
  rest.forEach((element) => {
    sum += element;
  });
}

getSum(1, 2, 3);
getSum(1, 2, 3, 4, 5);
